local-load-test.yml
config:
  target: "http://localhost:3000/"  # Your local development server
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      name: "Sustained load"
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 5000  # 95% under 5 seconds
      - http.response_time.p99: 10000 # 99% under 10 seconds

scenarios:
  - name: "Basic Health Check"
    flow:
      # Test if your server is running
      - get:
          url: "/"
          ensure:
            status: 200